app/controllers/words_controller.rb

  def create
    Array(params[:words]).each do |word|
      Word.create(sorted_chars: Word.sort(word), chars: word)
---
INSERT INTO `words` (`sorted_chars`, `chars`, `created_at`, `updated_at`) VALUES ('eilnst', 'silent', '2017-01-17 14:02:40', '2017-01-17 14:02:40')

  def show
    results = Word
      .where(sorted_chars: Word.sort(params[:word]))
      .where("chars != ?", params[:word])
      .pluck(:chars)
---
SELECT `words`.`chars` FROM `words` WHERE `words`.`sorted_chars` = 'ader' AND (chars != 'dare')

  def destroy
    word = Word.find_by(chars: params[:word])
    word.delete if word
---
SELECT  `words`.* FROM `words` WHERE `words`.`chars` = 'read' LIMIT 1
DELETE FROM `words` WHERE `words`.`id` = 1